zephyrproject-rtos/hal_infineon/mtb-hal-cat1/COMPONENT_PSOC6HAL/source/cyhal_hwmgr_impl_part.h
/* The order of items here must match the order in cyhal_clock_impl.h
 *
 * Each entry in the array below is the prior entry plus the number of clocks that exist
 * of the prior type. When there is only 1 clock (e.g: IMO/ECO) the next number is simply
 * one higher than the previous value. When there are multiple clocks (e.g.: PathMux/PLL)
 * the subsequent value is increased by the define that specifies how many clocks are
 * actually present. */
static const uint8_t cyhal_block_offsets_clock[PERI_PERI_PCLK_PCLK_GROUP_NR * 4 + 22] =
{
    // Peripheral dividers (8-bit, 16-bit, 16.5-bit & 24.5 bit) for each group
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 0)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(0),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 1)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(1),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 2)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(2),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 3)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(3),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 4)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(4),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 5)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(5),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 6)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(6),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 7)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(7),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 8)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(8),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 9)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(9),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 10)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(10),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 11)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(11),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 12)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(12),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 13)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(13),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 14)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(14),
    #endif
    #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 15)
        CY_MXSPERI_PCLK_DIV_CNT_OFFSETS(15),
    #endif

    PERI_DIV_NR,                                                                                    // IHO
    PERI_DIV_NR + 1,                                                                                // IMO
    PERI_DIV_NR + 2,                                                                                // ECO
    PERI_DIV_NR + 3,                                                                                // EXT
    PERI_DIV_NR + 4,                                                                                // ALTHF
    PERI_DIV_NR + 5,                                                                                // ALTLF
    PERI_DIV_NR + 6,                                                                                // ILO
    PERI_DIV_NR + 7,                                                                                // PILO
    PERI_DIV_NR + 8,                                                                                // WCO
    PERI_DIV_NR + 9,                                                                                // MFO

    PERI_DIV_NR + 10,                                                                               // PathMux

    PERI_DIV_NR + SRSS_NUM_CLKPATH + 10,                                                            // FLL
    PERI_DIV_NR + SRSS_NUM_CLKPATH + 11,                                                            // PLL200
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + 11,                                         // PLL400
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + 11,                      // ECO_PreScaler

    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + 12,                      // LF
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + 13,                      // MF
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + 14,                      // HF

    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + 14,    // PUMP
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + 15,    // BAK
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + 16,    // AltSysTick
    PERI_DIV_NR + SRSS_NUM_CLKPATH + SRSS_NUM_PLL200M + SRSS_NUM_PLL400M + SRSS_NUM_HFROOT + 17,    // Peri
};

#elif defined(COMPONENT_CAT2)
/* The order of items here must match the order in cyhal_clock_impl.h
 *
 * Each entry in the array below is the prior entry plus the number of clocks that exist
 * of the prior type. When there is only 1 clock (e.g: IMO/ECO) the next number is simply
 * one higher than the previous value. When there are multiple clocks (e.g.: PCLK)
 * the subsequent value is increased by the define that specifies how many clocks are
 * actually present. */
static const uint8_t cyhal_block_offsets_clock[16] =
{
    0,                                                                  // 8-bit dividers
    PERI_PCLK_DIV_8_NR,                                                 // 16-bit dividers
    PERI_PCLK_DIV_8_NR + PERI_PCLK_DIV_16_NR,                           // 16.5 bit dividers
    PERI_PCLK_DIV_8_NR + PERI_PCLK_DIV_16_NR + PERI_PCLK_DIV_16_5_NR,   // 24.5 bit dividers

    PERI_PCLK_CLOCK_NR,                                                 // IMO
    PERI_PCLK_CLOCK_NR + 1,                                             // ECO
    PERI_PCLK_CLOCK_NR + 2,                                             // EXT
    PERI_PCLK_CLOCK_NR + 3,                                             // ILO
    PERI_PCLK_CLOCK_NR + 4,                                             // WCO

    PERI_PCLK_CLOCK_NR + 5,                                             // WDCSEL
    PERI_PCLK_CLOCK_NR + 6,                                             // PLLSEL
    PERI_PCLK_CLOCK_NR + 7,                                             // PLL
    PERI_PCLK_CLOCK_NR + 8,                                             // LF
    PERI_PCLK_CLOCK_NR + 9,                                             // HF
    PERI_PCLK_CLOCK_NR + 10,                                            // PUMP
    PERI_PCLK_CLOCK_NR + 11,                                            // SYS
};
#endif

static const uint8_t cyhal_block_offsets_dma[] =
{
    0,
#if defined(CY_IP_MXAHBDMAC_INSTANCES)
#if (CY_IP_MXAHBDMAC_INSTANCES > 1)
    MXAHBDMAC0_CH_NR,
#endif
#if (CY_IP_MXAHBDMAC_INSTANCES > 2)
    MXAHBDMAC0_CH_NR + MXAHBDMAC1_CH_NR,
#endif
#if (CY_IP_MXAHBDMAC_INSTANCES > 3)
    #warning Unhandled DMA instance count
#endif
#endif /* defined(CY_IP_MXAHBDMAC_INSTANCES) */
};

#if defined(COMPONENT_CAT1A) || defined(COMPONENT_CAT1B)
static const uint8_t cyhal_block_offsets_dw[] =
{
    0,
    CPUSS_DW0_CH_NR,
};

static const uint8_t cyhal_block_offsets_tdm[] =
{
    0,
#if defined(CY_IP_MXTDM_INSTANCES)
#if (CY_IP_MXTDM_INSTANCES > 1)
    TDM_NR,
#endif
#endif
};
#endif

